#+title: NTangle

Basic tangling of Org documents using Nim.

* History
The ~ntangle.nim~ file was written as an exercise to roughly translate the
Python script [[https://github.com/thblt/org-babel-tangle.py][~org-babel-tangle.py~]] (by @thblt) to Nim.
* Caution
I do not recommend using this for tangling Org files. It worked well for the
lightly tested file in the ~test/~ dir of this repo.

See the [[https://orgmode.org/manual/Extracting-source-code.html][Org Manual -- Extracting source code]] section for *real Org tangling*.
* Building
[[https://github.com/nim-lang/nimble][~nimble~]] is used to build this project. This utility ships with Nim
installation. Think of it as the equivalent of ~pip~ in Python.

With Nim/~nimble~ installed, do:
#+begin_example
git clone https://github.com/kaushalmodi/ntangle
cd ntangle
nimble build # creates the ntangle binary in the git repo root dir
#+end_example
* Installing
If you want to install it (will build the binary and copy it to
=~/.nimble/bin/=), do:
#+begin_example
# cd to the git repo dir
nimble install
#+end_example

/You need to have added =~/.nimble/bin/= to your ~PATH~ environment
variable.
* Testing
#+begin_src shell :results output verbatim
cd tests
./test.sh
#+end_src

#+RESULTS:
#+begin_example
  Verifying dependencies for ntangle@0.1.0
   Building ntangle/ntangle using c backend
Parsing tests/test1.org ..
  Writing tests/test_passing.nim (8 lines) ..
  Writing tests/test_failing.nim (8 lines) ..

Parsing tests/tangle_no_yes.org ..
  Writing tests/specified_file.nim (2 lines) ..
  Writing tests/tangle_no_yes.nim (2 lines) ..

Parsing tests/src_blocks_with_extra_indentation.org ..
  Writing tests/hello2.nim (3 lines) ..
  Writing tests/hi2.nim (3 lines) ..

Parsing tests/multiple_src_blocks_tangled_to_same_file.org ..
  Writing tests/hello.nim (3 lines) ..
  Writing tests/hi.nim (3 lines) ..

Parsing tests/write-yourself-a-git.org ..
  [WARN] Line 200 - ':noweb' header argument is not supported at the moment.
  [WARN] Line 226 - ':noweb' header argument is not supported at the moment.
  [WARN] Line 339 - ':noweb' header argument is not supported at the moment.
  Writing tests/libwyag.py (683 lines) ..
  Writing tests/wyag (5 lines) ..
  Writing tests/wyag-tests (104 lines) ..

#+end_example
* Limitations
I wouldn't be surprised if there are many more limitations than the
few listed below:
- Does not support Org heading specific header properties.
- Does not support file specific header properties.
- Does not support ~noweb~. I sorely miss the lack of ~noweb~
  support.. I use it heavily in [[https://github.com/kaushalmodi/eless][~eless~]].
- A lot of other tangle options.. Visit ~(org) Extracting Source Code~
  Info manual node.
